Repository: oliver-maender/olivermaender
Catalog: messages.*.xlf
Languages: de

# aboutMeHeadline
source: About me
de: Über mich

# aboutMeText
source: My name is Oliver Mänder. I am 23 years old and a German front-end developer living at Lake Constance. I joined the <span class="highlight"><a class="highlight" href="https://www.developerakademie.com/">Developer Akademie</a></span> in <span class="highlight">January 2021</span>, there I started learning my main skills <span class="highlight">HTML</span>, <span class="highlight">CSS</span>, <span class="highlight">JavaScript</span> and <span class="highlight">Angular</span>. I have built several projects over the last months, some of them are still getting new features. Furthermore, I am currently getting more experience every day with Angular and I also started learning <span class="highlight">React</span> in <span class="highlight">February 2022</span>. My interests are everything that has to do with computers and other technical devices + watching different kinds of sports like American Football, Soccer, Motorsports, Basketball and more.
de: Mein Name ist Oliver Mänder. Ich bin 23 Jahre alt, ein deutscher Front-end Entwickler und lebe am Bodensee. Im <span class="highlight">Januar 2021</span> trat ich der <a class="highlight" href="https://www.developerakademie.com/"><span class="highlight">Developer Akademie</span></a> bei und lernte dort meine Hauptprogrammiersprachen <span class="highlight">HTML</span>, <span class="highlight">CSS</span>, <span class="highlight">JavaScript</span> und <span class="highlight">Angular</span>. Über die letzten Monate habe ich mehrere Projekte gebaut und erweitere einige davon immer noch um neue Features. Zusätzlich werde ich jeden Tag erfahrener mit Angular und began außerdem im <span class="highlight">Februar 2022</span> damit <span class="highlight">React</span> zu lernen. Meine Hobbies sind alles, was mit Computern und sonstigen technischen Geräten zu tun hat + das Schauen von verschiedenen Sportarten wie American Football, Fußball, Motorsport, Basketball und mehr.

# aboutMeForwarding
source: Want to learn more about my work?
de: Erfahre mehr über meine Projekte

# contactHeadline
source: Contact me
de: Kontakt

# contactHintText
source: Get in touch with me by using the form below or by emailing me <a href="mailto:contact@olivermaender.de">contact@olivermaender.de</a>
de: Kontaktieren Sie mich über dieses Kontaktformular oder schreiben Sie mir auch gerne eine E-Mail an <a href="mailto:contact@olivermaender.de">contact@olivermaender.de</a>

# contactFormMessage
source: Message
de: Nachricht

# contactFormSendButton
source: Send
de: Senden

# firstSectionMyName
source: I AM<br>OLIVER MÄNDER
de: ICH BIN<br>OLIVER MÄNDER

# firstSectionJobName
source: German front-end developer
de: Deutscher Front-end Entwickler

# footerLegalNotice
source: Legal Notice
de: Impressum

# footerDataPrivacy
source: Data Privacy
de: Datenschutz

# footerLogoHintText
source: Created my logo at <a href="http://logomakr.com/">LogoMakr.com</a>
de: Logo erstellt bei <a href="http://logomakr.com/">LogoMakr.com</a>

# menuHomeDesktop
source: HOME
de: START

# menuAboutMeDesktop
source: ABOUT ME
de: ÜBER MICH

# menuMyWorkDesktop
source: MY WORK
de: MEINE PROJEKTE

# menuContactDesktop
source: CONTACT
de: KONTAKT

# menuHomeMobile
source: HOME
de: START

# menuAboutMeMobile
source: ABOUT ME
de: ÜBER MICH

# menuMyWorkMobile
source: MY WORK
de: MEINE PROJEKTE

# menuContactMobile
source: CONTACT
de: KONTAKT

# myWorkHeadline
source: My work
de: Meine Projekte

# myWorkTryItOutButton
source: Try it out
de: Ausprobieren

# myWorkSportsHomeDescription
source: This is my favourite project. You can <b>see and also change the match results of different soccer leagues</b> I implemented. If you change or add the results for matches, the standings will <b>dynamically change</b>, so you will always be up-to-date with your favourite leagues.
de: Dies ist mein Lieblingsprojekt. Man kann <b>die Ergebnisse von verschiedenen Fußballligen sehen und auch verändern</b>. Wenn man das Ergebnis eines Spiels verändert oder hinzufügt, wird die Tabelle <b>dynamisch angepasst</b>, damit man immer die aktuelle Tabelle seiner Lieblingsligen sieht.

# myWorkJoinDescription
source: Join is a group project of three Developer Akademie students including me. It is a <b>custom version of a Kanban board</b>. You can add things that have to be done to a pool of ideas (the backlog) and push a certain amount to the board which shows the next "sprint" of features which should be implemented. On the board you can distribute them between to-do, in progress, testing and done.
de: Join ist ein Gruppenprojekt von drei Developer Akademie Schülern inklusive mir. Es ist eine <b>eigene Version eines Kanban Boards</b>. Man kann die Dinge, die gemacht werden müssen in einen Ideenpool (dem Backlog) hinzufügen und immer eine bestimmte Menge, die als Nächstes gemacht werden muss (der aktuelle "Sprint") auf das Board verschieben. Auf dem Board kann man die Tickets zwischen To-Do, In Arbeit, Testen und Fertig verschieben.

# myWorkQuizWithFriendsDescription
source: This is a <b>quiz application</b> you can use to quiz with your friends (as the name suggests).
de: Dies ist ein <b>Quiz</b> bei dem man gegen seine Freunde spielen kann.

# myWorkCommPlatDescription
source: This is a communication platform with different public channels and also private messages <b>similar to Discord or Slack</b>. You have the possibility to reply to a message which creates an own thread for every topic, so you don't have to spam the main channel with answers.
de: Dies ist eine Kommunikationsplattform mit verschiedenen öffentlichen Kanälen und der Möglichkeit private Nachrichten zu verschicken <b>ähnlich wie bei Discord oder Slack</b>. Man hat die Möglichkeit auf eine Nachricht direkt zu antworten und somit einen eigenen Thread zu erstellen, damit die Antworten auf eine Nachricht sortiert erscheinen.

# myWorkElPolloLocoDescription
source: El Pollo Loco is a <b>jump-and-run game</b> I built 7 weeks after I joined the Developer Akademie and was the final pure JavaScript project before I started with Angular. You have to control Pepe to <b>collect coins and tabasco bottles, avoid the chickens and reach the final boss</b>, el pollo loco (the crazy chicken), and defeat it.
de: El Pollo Loco ist ein <b>Jump-And-Run Spiel</b>, das ich bereits 7 Wochen nach dem Beginn bei der Developer Akademie programmiert habe und war das letzte reine JavaScript Projekt bevor ich mit Angular begann. Man muss Pepe steuern und mit ihm <b>Münzen und Tabasco Flaschen einsammeln, dabei den Hühnern ausweichen und den finalen Boss</b>, el pollo loco (das verrückte Hühnchen), erreichen und besiegen.

# myWorkMyHomepageDescription
source: This is the page you are currently viewing. It is about me and my work.
de: Das ist die Webseite, auf der Sie momentan sind. Sie ist über mich und meine Projekte.
